# CannotPasteViewSpecificElementsIntoPerspectiveView Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..CopyPasteFailures..::..CannotPasteViewSpecificElementsIntoPerspectiveView Property
BuiltInFailures..::..CopyPasteFailures Class See Also
---
Can't paste view specific elements into perspective view.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotPasteViewSpecificElementsIntoPerspectiveView { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotPasteViewSpecificElementsIntoPerspectiveView As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotPasteViewSpecificElementsIntoPerspectiveView {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..CopyPasteFailures Class
Autodesk.Revit.DB Namespace